[{"name":"Downtown","bulletDescription":"Great fishing right in town","id":6,"locations":[{"name":"5th Street Bridge","id":20,"desc":"The water here offers opportunities for all types of angling, from dry-fly action to streamer and nymph fishing. The views are splendid--the river appears to flow directly below Mt. Werner's ski runs--and nearby bars and restaurants provide attractive hangouts for non-angling buddies (or anglers bent on toasting a successful session). From the bridge, you can eye the big, deep pool just upstream. You'll probably even spot some of its enormous residents. Give them a shot, but don't be surprised if they seem elusive: This pool sees more angling pressure than any other in town, so it's fish are well schooled and wary.\r\n\r\nBelow the bridge, sections of smoother water offer good surface fishing in mid-morning and evening (try a dry\/dropper combo). Some stretches are slow enough to fish well in spring, just after runoff. Most parts of the bank downstream of the bridge are thick with trees and willows, but a few openings provide non-fishing spectators a place to perch on a rock. Wading becomes increasingly difficult as you continue downriver. The water along the banks is very deep, and pedestrians are not allowed on the railroad's land on the west side of the river (where the railroad tracks run). Expect to skirt deep channels and hop boulders--efforts that tend to thin crowds. Although the bridge hole gets hammered, far fewer anglers venture to the additional holes downriver.","directions":"Park in front of Steamboat Fly Fisher retail establishment - 5th and Yampa Street, downtown Steamboat Springs. Alternative parking can be found on River Road at the Rodeo Grounds.","bulletDescription":"Pocket water in town","bugs":[{"name":"Caddis Nymph","id":20,"spring":"1","summer":"0","fall":"0","winter":"0"},{"name":"Caddis Emerger","id":21,"spring":"0","summer":"1","fall":"0","winter":"0"},{"name":"Blue Wing Olive Nymph","id":11,"spring":"1","summer":"1","fall":"0","winter":"0"},{"name":"March Brown Dry","id":10,"spring":"0","summer":"0","fall":"1","winter":"1"},{"name":"Ant","id":28,"spring":"0","summer":"1","fall":"1","winter":"0"},{"name":"Blue Wing Olive Dry","id":13,"spring":"1","summer":"1","fall":"1","winter":"0"},{"name":"Blue Wing Olive Emerger","id":12,"spring":"0","summer":"1","fall":"1","winter":"0"},{"name":"Blue Wing Olive Nymph","id":11,"spring":"1","summer":"1","fall":"1","winter":"0"},{"name":"Caddis Dry","id":22,"spring":"0","summer":"1","fall":"1","winter":"0"},{"name":"Caddis Nymph","id":20,"spring":"1","summer":"1","fall":"1","winter":"1"},{"name":"Egg","id":23,"spring":"1","summer":"0","fall":"1","winter":"0"},{"name":"Hopper","id":27,"spring":"0","summer":"1","fall":"1","winter":"0"},{"name":"March Brown Dry","id":10,"spring":"0","summer":"0","fall":"1","winter":"0"},{"name":"March Brown Emerger","id":9,"spring":"0","summer":"0","fall":"1","winter":"0"},{"name":"March Brown Nymph","id":8,"spring":"0","summer":"0","fall":"1","winter":"0"},{"name":"Pale Morning Dun Dry","id":19,"spring":"1","summer":"0","fall":"0","winter":"0"},{"name":"San Juan Worm","id":24,"spring":"1","summer":"0","fall":"0","winter":"1"}]},{"name":"Art Depot","id":21,"desc":"Some of the biggest trout in town lurk here, where three man-made drops create particularly deep pools. Twelve to 16 inch fish are typical; big guys exceed 18 inches. River access is easy and direct, and the banks are family friendly. Kids can hang out in the nearby library or sunbathe on the bouldery \"beach\" just upstream of from the depot. Of course, all that awesomeness makes this a really crowded spot come summer--not so much with anglers, but with tubers, dog-walkers, and swimmers. Join them, if you like people watching (and don't mind putting on a show for others). This is also a great spot if you lack waders, because most of the fishing can be done from the banks rather than in the water. From the Art Depot, look beneath the pedestrian bridge to find the first pool, which can be fished from either bank. Two more pools sit immediately upriver. Nymphing is your best strategy, and during periods of high water, try drifting your rig in the eddies' upstream current.\r\n","directions":"From Downtown steamboat head west on Lincoln Avenue\/US-40. At the stoplight at 13th street take a left. Cross the bridge and turn right in to the Art Depot(an old actually train depot). Park here.","bulletDescription":"3 Deep Holes","bugs":[{"name":"Blue Wing Olive Dry","id":13,"spring":"0","summer":"1","fall":"1","winter":"0"},{"name":"Blue Wing Olive Nymph","id":11,"spring":"1","summer":"1","fall":"1","winter":"1"},{"name":"Caddis Nymph","id":20,"spring":"0","summer":"1","fall":"1","winter":"0"},{"name":"Egg","id":23,"spring":"1","summer":"0","fall":"1","winter":"0"},{"name":"Pale Morning Dun Nymph","id":17,"spring":"1","summer":"0","fall":"0","winter":"0"},{"name":"San Juan Worm","id":24,"spring":"1","summer":"1","fall":"1","winter":"1"},{"name":"Trico Nymph","id":14,"spring":"0","summer":"1","fall":"0","winter":"0"},{"name":"Yellow Sally Nymph","id":6,"spring":"1","summer":"1","fall":"0","winter":"0"},{"name":"Stone Fly Nymph","id":4,"spring":"1","summer":"0","fall":"0","winter":"0"}]},{"name":"James Brown Bridge","id":22,"desc":"This is one of the deepest holes on the Yampa through town, and consequently, this is where some of the biggest fish hide (it's a great place to try to top 20 inches). A sinking-tip leader or line would be helpful for plumbing the depths. From your parking spot east of James Brown Soul Center of the Universe Bridge, walk along the bike path on the upstream side of the bridge and then cut onto the river before going under the bridge. Follow the river upstream to the big bend. Try tossing a streamer along the abrupt drop-off into the pool: That shelf offers your best chance of hooking a fish. In midsummer, fish hug the bottom and are harder to reach. When in doubt, tack on another split shot. Hatches rarely happen here, and trout are not often seen sipping from the surface. In late summer and fall, fish will move into the riffle above the pool.\r\n\r\nWith railroad equipment operating on the west bank and a cluster of live\/work condos on the east bank, this stretch is not particularly scenic. But it's generally uncrowded, and offers a prime shot at some of the town's trophy fish.","directions":"Heading west on Lincoln Ave\/Us-40 turn left at 13th street. Follow for about a mile until taking a right onto James Brown Soul Center of the Universe Bridge. Park on the road just past the bridge.","bulletDescription":"Big deep bend","bugs":[{"name":"Blue Wing Olive Nymph","id":11,"spring":"1","summer":"1","fall":"0","winter":"0"},{"name":"Caddis Dry","id":22,"spring":"0","summer":"1","fall":"1","winter":"0"},{"name":"Caddis Nymph","id":20,"spring":"1","summer":"1","fall":"1","winter":"1"},{"name":"Egg","id":23,"spring":"1","summer":"0","fall":"1","winter":"0"},{"name":"San Juan Worm","id":24,"spring":"1","summer":"1","fall":"1","winter":"1"},{"name":"Pale Morning Dun Nymph","id":17,"spring":"1","summer":"1","fall":"0","winter":"0"},{"name":"Streamer","id":29,"spring":"1","summer":"1","fall":"1","winter":"1"},{"name":"Stone Fly Nymph","id":4,"spring":"1","summer":"1","fall":"0","winter":"0"},{"name":"Yellow Sally Nymph","id":6,"spring":"1","summer":"0","fall":"0","winter":"0"}]},{"name":"Rabbit Ears","id":19,"desc":"This is a great place to go in the heat of summer. The Yampa is narrower here (an island divides the main current) and the channel flowing along U.S. 40 is deep and cold, sheltering trout when other parts of the river get too warm. From your parking spot at Dr. Rich Weiss park (beside the Rabbit Ears Hotel), follow the bike path for some 20 yards to a pedestrian bridge crossing the river. Cross to the west side to fish the one or two downstream pools (try slipping a streamer through the eddies) or stay to the east side to work your way upstream along a quarter-mile series of holes. This stretch hides below a steep grassy hill; another hill behind the bike path further helps to insulate anglers from traffic on US 40. The river's roar also drowns out highway noise: Several boulders, drops and rock jetties create splashy rapids that oxygenate the water (and make this section less than ideal during periods of high water, such as spring runoff). Nymphs and streamers can be productive.\r\n\r\nDr. Rich Weiss park is also a swell spot for non-angling companions to hang out while you fish. Here you will find the \"Hobo Hot Springs,\" two riverside pools fed by the runoff from the Old Town Hot Springs across the street. On hot summer days, it's more refreshing to just splash in the river (and plenty do--this is a very crowded spot until fall). There's also a bathroom and a charcoal grill on the park's grassy, tree shaded lawn.","directions":"Parking is on the west side of HWY 40, just south of the Rabbit Ears Hotel - downtown Steamboat Springs.","bulletDescription":"Great Structure","bugs":[{"name":"Blue Wing Olive Dry","id":13,"spring":"0","summer":"1","fall":"0","winter":"0"},{"name":"Blue Wing Olive Nymph","id":11,"spring":"1","summer":"1","fall":"1","winter":"0"},{"name":"Caddis Dry","id":22,"spring":"0","summer":"1","fall":"1","winter":"0"},{"name":"Caddis Emerger","id":21,"spring":"0","summer":"1","fall":"1","winter":"0"},{"name":"Caddis Nymph","id":20,"spring":"1","summer":"1","fall":"1","winter":"1"},{"name":"March Brown Dry","id":10,"spring":"0","summer":"0","fall":"1","winter":"0"},{"name":"Pale Morning Dun Dry","id":19,"spring":"1","summer":"0","fall":"0","winter":"0"},{"name":"Pale Morning Dun Nymph","id":17,"spring":"1","summer":"1","fall":"0","winter":"0"},{"name":"Stone Fly Nymph","id":4,"spring":"1","summer":"1","fall":"0","winter":"0"},{"name":"Trico Nymph","id":14,"spring":"0","summer":"1","fall":"0","winter":"1"},{"name":"Yellow Sally Dry","id":7,"spring":"0","summer":"1","fall":"0","winter":"0"},{"name":"Yellow Sally Nymph","id":6,"spring":"1","summer":"1","fall":"0","winter":"0"}]}]},{"name":"Stagecoach","bulletDescription":"Big Fish,Small Water","id":1,"locations":[{"name":"RCR 18","id":16,"desc":"Uncrowded, scenic and productive, this section of the Yampa is surrounded by some of the region's most sought-after private water, so anglers here can cast at trout that haven't been hammered by continual pressure. Here, you can generally throw bigger flies that you can actually see: Size 16 Elk Hair Caddis and Stimulators draw rises. Steep, forested walls create a feeling of seclusion.\r\n\r\nBig boulders create pocket water where wading is slick--expect to move slowly and deliberately, especially since trout here can be more skittish than ones that see constant anglers. Brushy banks make for challenging casting and offer few nooks for companions who don't fish. Shallow water depths warm up faster than other stretches, making this spot less than ideal during the heat of summer.","directions":"Drive time from downtown: about 35 minutes.\r\n\r\nHead southeast from downtown Steamboat Springs on US-40\/Lincoln Avenue for 4 miles. Turn right and follow CO-131 South for 4.5 miles. Turn left onto County Rd 18. Continue on paved CR-18 with Catamount Reservoir on your left, then through a sharp left turn. CR-18 turns to dirt at mile 3.4. High-clearance, 2wd access on dirt road continues for about a mile until you reach the public water on the left (dirt road closed in the winter).","bulletDescription":"Beautiful, high walled canyon","bugs":[{"name":"Attractor Dry","id":26,"spring":"0","summer":"1","fall":"1","winter":"0"},{"name":"Caddis Dry","id":22,"spring":"1","summer":"1","fall":"1","winter":"0"},{"name":"Caddis Nymph","id":20,"spring":"1","summer":"1","fall":"0","winter":"0"},{"name":"March Brown Dry","id":10,"spring":"0","summer":"0","fall":"1","winter":"0"},{"name":"San Juan Worm","id":24,"spring":"1","summer":"1","fall":"1","winter":"1"},{"name":"Stone Fly Nymph","id":4,"spring":"1","summer":"0","fall":"0","winter":"0"},{"name":"Streamer","id":29,"spring":"1","summer":"1","fall":"1","winter":"1"},{"name":"Hopper","id":27,"spring":"0","summer":"1","fall":"1","winter":"0"},{"name":"Ant","id":28,"spring":"0","summer":"0","fall":"0","winter":"0"}]},{"name":"Sarvis Creek","id":13,"desc":"Just downstream of the Stagecoach tailwaters, this isolated, mile-long section of the Yampa River offers standout scenery and solitude. Compared to the in-town stretches, it feels more like a high-mountain river. Hoppers and Stimulators are more successful here than on other stretches, and views are pristine, since this section borders the Sarvis Wilderness.\r\n\r\nNext to the parking lot, a bridge spans the river. Holes immediately upstream and downstream of the bridge can be crowded, especially on weekends. But you can leave most anglers behind by exploring a few hundred yards downstream, where the Yampa combines pocket water and riffles. Or hike upstream for nearly a mile. Brushy riverbanks occasionally call for a roll cast, and because the water is relatively narrow (30 to 40 feet wide), extensive wading isn't required. However, one productive strategy is standing near the middle and casting towards the banks.\r\n\r\nThick riverbank vegetation makes this a tricky spot for non-angling companions, though they might enjoy hiking the Sarvis Creek trail into the wilderness (anglers park near the trailhead, follow the 2 track across the bridge).","directions":"Drive time from downtown: about 30 minutes\r\n\r\nHead southeast from downtown Steamboat Springs on US-40\/ Lincoln Ave for 4.1 miles. Turn right onto CO-131 South and drive 4.5 miles. Turn left onto County Road 18. Continue on paved CR-18 with catamount reservoir on your left, through a sharp left turn. CR-18 turns to dirt at mile 3.4 (high clearance recommended, road closed at this point in winter. In 2 miles take a left down to the Sarvis Creek trailhead parking. Winter access via parking at the gate.","bulletDescription":"Hidden gem with big fish","bugs":[{"name":"Blue Wing Olive Dry","id":13,"spring":"0","summer":"1","fall":"0","winter":"0"},{"name":"Caddis Dry","id":22,"spring":"0","summer":"1","fall":"1","winter":"0"},{"name":"Streamer","id":29,"spring":"1","summer":"1","fall":"1","winter":"1"},{"name":"Egg","id":23,"spring":"1","summer":"0","fall":"1","winter":"0"},{"name":"Hopper","id":27,"spring":"0","summer":"1","fall":"1","winter":"0"},{"name":"Attractor Dry","id":26,"spring":"1","summer":"1","fall":"1","winter":"0"},{"name":"Stone Fly Dry","id":5,"spring":"1","summer":"1","fall":"0","winter":"0"},{"name":"Stone Fly Nymph","id":4,"spring":"1","summer":"0","fall":"0","winter":"0"},{"name":"Caddis Nymph","id":20,"spring":"1","summer":"1","fall":"1","winter":"1"},{"name":"San Juan Worm","id":24,"spring":"1","summer":"0","fall":"0","winter":"1"},{"name":"Yellow Sally Dry","id":7,"spring":"1","summer":"1","fall":"0","winter":"0"},{"name":"Trico Dry","id":16,"spring":"0","summer":"1","fall":"0","winter":"0"},{"name":"Caddis Emerger","id":21,"spring":"0","summer":"1","fall":"0","winter":"0"}]},{"name":"Tailwater","id":15,"desc":"Want to sight-fish to really big trout? This stretch of the upper Yampa River holds the most fish per mile--2,000 or more--and they're big, averaging 14 to 18 inches (monsters measuring 20-plus inches are common too). The super-clear, often shallow water offers plenty of opportunity to cast for individual fish. The tailwater fishes great all year except for the occasional overflow of the damn during spring run-off (check the flows online).\r\n\r\nThese rainbows (and isolated browns, brookies and cutthroats) see more anglers than any other part of the river, and the heavy pressure makes these fish smarter and pickier than most. Pack 6X tippet, small strike indicators (preferably white, black or clear), and tiny midge patterns (size 20 or smaller). Use a long leader--9 feet, plus tippet lengths-- and bring a few dries, such as Griffith's Gnat and Blue-Wing olive patterns. Trout here sip off the surface year round.\r\n\r\nFrom the parking area (be sure to pay the day use fee, as citations are regularly issued), follow the dirt foot path for the quick walk down to the river. From here it's 10 minutes further to the dam, or walk a few hundred yards downriver to where the Yampa enters a narrow cliff-walled canyon. Between the dam and the canyon, you'll find pool\/riffle\/pool structures, some reworked by Parks and Wildlife in 2014 to increase water speed and oxygen levels. Riverbanks that were once relatively open and grassy now evidence even less vegetation, making for easy casting along most holes. Plenty of spots along the river's edge offer good spectating for non-angling companions. Toward the dam, the river narrows and offers more pocket water. Slower sections near the parking lot offer more technical angling.\r\n","directions":"Drive time form downtown: 30 minutes\r\n\r\nHead southwest from downtown Steamboat Springs on US-40\/Lincoln Avenue for 4.1 miles. Turn right onto CO-131 South. After 6.4 miles, follow signage for StageCoach Lake State park--a left turn onto County Road 14. Continue on CR-14 for 5.4 miles, turn left on County Road 18 (graded dirt road) and follow it through the gate to the left. The road is closed her during the winter. Follow Cr-18 for 2 miles to the parking area past the dam.","bulletDescription":"Great tailwater fishery","bugs":[{"name":"Blue Wing Olive Dry","id":13,"spring":"1","summer":"1","fall":"1","winter":"1"},{"name":"Blue Wing Olive Emerger","id":12,"spring":"0","summer":"1","fall":"1","winter":"0"},{"name":"Blue Wing Olive Nymph","id":11,"spring":"1","summer":"1","fall":"1","winter":"1"},{"name":"Caddis Dry","id":22,"spring":"0","summer":"1","fall":"0","winter":"0"},{"name":"Egg","id":23,"spring":"1","summer":"0","fall":"0","winter":"0"},{"name":"March Brown Dry","id":10,"spring":"0","summer":"0","fall":"1","winter":"0"},{"name":"Pale Morning Dun Dry","id":19,"spring":"1","summer":"1","fall":"0","winter":"0"},{"name":"Trico Dry","id":16,"spring":"0","summer":"1","fall":"1","winter":"0"},{"name":"Trico Nymph","id":14,"spring":"0","summer":"1","fall":"1","winter":"0"}]}]},{"name":"Town South","bulletDescription":"Just outside of town, less crowds","id":2,"locations":[{"name":"Car Wash","id":8,"desc":"Close to town but surprisingly secluded, this stretch feels farther away than it actually is. Huge old trees shade the river and steep hills tower above its west bank, so anglers enjoy some respite from the summer sun (and because of the close hills, sunset arrives earlier too). The river's steeper gradient creates splashy drops that oxygenate the water, which is why fishing can be good here even on summer afternoons. Fast-moving water and especially feisty fish make for exciting action. And you probably won't have to fight off crowds of other anglers, since this section sees less pressure than most pools in or near town.\r\n\r\nPockets of deep, rushing water make for challenging wading. This is a good place to be tall strong, equipped with a wading staff--or all of the above. But the abundance of big boulders creates lots of enticing pocket water. Try running a hopper or caddis rig around the boulders, or run a streamer through the calm water behind them.\r\n\r\nFrom your parking spot behind the Verizon store\/ by the self-serve car wash, follow Trafalger street away from U.S. 40. Where Trafalger bends to the left, pick up the paved Yampa River Core Trail, which continues west towards the river ( a five minute walk from Verizon). Just after you pass the last house on your right, look for a dirt path through the scrub to your right: This is your first river access point,and leads to cobble-bottomed flats.\r\n\r\nFor classic pocket water, return to the Core Trail and continue upstream for about .25 of a mile to where the trail rejoins the river. Here you will find a mix of pools, and can access even more by picking your way either direction on the river. A park bench along the core trail is the best perch for non-angling pals, since a mix of trees, scrub and fallen logs along both banks prevent few opportunities to hang out or have a picnic.","directions":"Head south on Lincoln Ave from Downtown Steamboat Springs and turn right at the light onto Trafalger Drive(about 0.8 miles). Take the second left behind Freshies(a great place for Breakfast or Lunch) and park in the large parking lot before the self-serve car wash. ","bulletDescription":"Solitude in town","bugs":[{"name":"Blue Wing Olive Dry","id":13,"spring":"0","summer":"1","fall":"0","winter":"0"},{"name":"Blue Wing Olive Nymph","id":11,"spring":"1","summer":"1","fall":"1","winter":"0"},{"name":"Caddis Dry","id":22,"spring":"1","summer":"1","fall":"1","winter":"0"},{"name":"Caddis Nymph","id":20,"spring":"1","summer":"1","fall":"1","winter":"0"},{"name":"Egg","id":23,"spring":"1","summer":"0","fall":"1","winter":"0"},{"name":"Hopper","id":27,"spring":"0","summer":"1","fall":"0","winter":"0"},{"name":"March Brown Dry","id":10,"spring":"0","summer":"0","fall":"1","winter":"0"},{"name":"Pale Morning Dun Dry","id":19,"spring":"0","summer":"1","fall":"0","winter":"0"},{"name":"Stone Fly Nymph","id":4,"spring":"1","summer":"1","fall":"0","winter":"0"},{"name":"Yellow Sally Dry","id":7,"spring":"1","summer":"1","fall":"0","winter":"0"},{"name":"Yellow Sally Nymph","id":6,"spring":"1","summer":"1","fall":"0","winter":"0"},{"name":"Streamer","id":29,"spring":"1","summer":"1","fall":"1","winter":"0"},{"name":"Stone Fly Dry","id":5,"spring":"1","summer":"0","fall":"0","winter":"0"}]},{"name":"Chuck Lewis ","id":9,"desc":"Three separate parking areas provide access to the portion of the Yampa that flows through Chuck Lewis State Wildlife Area.\r\n\r\n1) The northernmost access point, on the east side of County Road 14 opposite Aspen Ridge Road, provides access to a pool\/drop stretch of the Yampa that holds fewer fish than other parts of the river--but they are bigger, and they are fond of hammering big flies. Floating a hopper here (in summer) or swinging a streamer (in fall) often results in an epic battle: You might not catch a fish on every cast, but if you do hook one, it'll linger in your memory. Avoid these holes (and the other Chuck Lewis stretches) during high water periods in spring (unless you want pike), when other parts of the Yampa offer more productive fishing. From the parking area walk .25 miles east through hay fields to the river, and ford it where the path meets the water (downstream holes are best accessed from the east bank). Walk downstream to the big bend and it's undercut bank. Deep water through this stretch calls for careful wading. For that reason, spectators have a hard time following you to these holes, though the banks are relatively open (especially in the wake of the 2014 Parks and Wildlife reconstruction, which removed braided currents and narrowed the river into one central flow). The valley is broader here, so mornings can be especially productive (these waters receive sunlight sooner than in town). Dusk lingers longer too, making this a great spot for evening sessions. You may even spot sandhill cranes.\r\n\r\n2) The middle parking lot, on County Road 14(off State Route 131) offers access to prime dry-fly fishing. The parking area is adjacent to a bridge over the Yampa: Just downstream of this bridge a stretch of slow, slick water is peppered with morning hatches of pale morning dunns, midges and tricos. Evenings, you'll see caddis, blue wing olives, and (in autumn) march browns. Thick willows along the banks make for difficult casting and offer few pleasant places for picnicking spectators (though they also create a sensation of isolation once on the water). Wading is easy, thanks to a sandy bottom--provided the water is shallow enough for steps. The banks plunge away dramatically, so anglers often find themselves chest-deep with one step. Move strategically, for your safety and to keep from spooking fish (no whitewater disguises your movements). Easy access and enticing surface action makes this a popular spot; expect to negotiate around other anglers. \r\n\r\n3) The southernmost parking lot (on County Road 14) accesses textbook-perfect trout water: you'll find undercut bends and plenty of boulders providing structure. But getting to the water requires more effort than at the other two Chuck Lewis access points, which explains why these holes see fewer anglers: you'll likely have this stretch (and it's gorgeous views south into pleasant Valley) all to yourself. From the parking area, walk past the vehicle gate on the south side and follow the two-track southeast to a bridge across the Yampa (a 5 minute walk). Just east of the river, a big pond offers opportunities to fish for pike. if you are after trout, cross the bridge to the east bank and start downriver through high grass and willows to explore nearly a mile of public water. The banks are high here (20 feet above the water in places) so getting to the holes sometimes requires a sporty scramble. Solitude and feisty fish reward your effort.","directions":"From downtown Steamboat Springs, take US 40 south for 4 miles. Turn right onto CO 131 and then another right at your first big bend in the road onto County Road 14. The middle parking lot will be 100 yards on your right before you cross the Yampa.\r\n\r\nTo get to the northernmost parking lot, continue over the Yampa and take your next right. The parking lot will be immediately over the rise to your right.\r\n\r\nTo get to the southernmost parking lot, continue over the Yampa for about 2.2 miles where you will turn left onto the parking lot.\r\n\r\nAll these lots are signed as Chuck Lewis State Wildlife Areas.","bulletDescription":"State Wildlife Area","bugs":[{"name":"Caddis Dry","id":22,"spring":"0","summer":"1","fall":"1","winter":"0"},{"name":"Caddis Nymph","id":20,"spring":"1","summer":"1","fall":"1","winter":"1"},{"name":"Egg","id":23,"spring":"1","summer":"0","fall":"1","winter":"0"},{"name":"Hopper","id":27,"spring":"0","summer":"1","fall":"1","winter":"0"},{"name":"March Brown Dry","id":10,"spring":"0","summer":"0","fall":"1","winter":"0"},{"name":"Pale Morning Dun Dry","id":19,"spring":"1","summer":"1","fall":"0","winter":"0"},{"name":"San Juan Worm","id":24,"spring":"1","summer":"1","fall":"1","winter":"1"},{"name":"Attractor Dry","id":26,"spring":"0","summer":"1","fall":"1","winter":"0"},{"name":"Stone Fly Nymph","id":4,"spring":"1","summer":"1","fall":"0","winter":"0"}]},{"name":"Fetcher Pond","id":18,"desc":"Good midsummer dry-fly fishing and a stocked pond for easy casting makes this a destination popular with experts and beginners alike. Local guides often take first-time anglers here, and it's a popular put-in for tubers in June and July--so crowds can be thick. But lots of structure creates obvious runs and pools: The river's trout spots are easy to read here. And wading is relatively easy, thanks to shallow depths and a gravelly bottom that presents few boulders to trip you. \r\n\r\nSeveral riffles through this section oxygenate the water and help it stay fishable on hot summer days. These are good spots to try nymphing with a hare's ear or Pat's rubber leg followed by a small PMD or BWO dropper. \r\n\r\nFrom the parking lot , you can cast to stocked trout in Fetcher Pond. River fishing is not the best right here.\r\n\r\nA better option is to follow the Yampa Core Trail (a paved bike path that runs alongside Fetcher Pond and its gravel parking area) and walk upstream 3 minutes until the path jogs left, then right. Here, look for a small footpath along a grassy ridge and follow it away from the Core Trail, toward the river (a one minute walk). You reach the river at the tail end of a pool known as Treehouse Bend, a long curving stretch fed by broad riffles. Don't be surprised if someone's already fishing here. It's a popular spot , but for good reason: The far bank holds plenty of trout--including some big ones--so it's worth a gander. Just employ some diplomacy should you find the hole occupied, and either move on, or ask the angler's permission to fish some distance away. It's a big hole, but not big enough to horn in without seeming like a marauder. High water can flood the willows bordering the pool, but during most of the summer and fall, a broad gravel beach offers non-angling spectators a pleasant place to sit and watch.\r\n\r\nWalking downstream is another good option from the Fetcher parking lot. A 300-yard commute on the Core Trail passes several nice holes on the left before crossing Fish Creek via a wooden bridge. Fish Creek's clear cold water can make the river downstream of the confluence a good destination on scorching summer days, or when the Yampa has been muddy. A gravel beach below the bridge is popular with kids and dog-walkers, and makes a nice hang out spot for non-angling companions. Fish Creek also contributes an additional food source, so trout are plentiful just below it. However, they typically cluster in the calm cold water on the east bank, where they get a good, long look at any fly you present. It's hard not to spook these trout, but if you land one, you'll be rewarded with plenty of actual applause (the Core Trail runs right alongside this pool).\r\n","directions":"Head southeast form downtown Steamboat on Lincoln Ave for 1.5 miles. Turn right onto Pine Grove Road,head straight through the small traffic circle then left onto Fetcher oak Drive to the 20-car parking lot. Bathroom facilities, small picnic area.","bulletDescription":"Easy access and a nice pond","bugs":[{"name":"Blue Wing Olive Dry","id":13,"spring":"0","summer":"1","fall":"1","winter":"0"},{"name":"Blue Wing Olive Nymph","id":11,"spring":"1","summer":"1","fall":"1","winter":"0"},{"name":"Blue Wing Olive Emerger","id":12,"spring":"0","summer":"1","fall":"1","winter":"0"},{"name":"Caddis Dry","id":22,"spring":"0","summer":"1","fall":"1","winter":"0"},{"name":"Caddis Nymph","id":20,"spring":"1","summer":"1","fall":"0","winter":"0"},{"name":"Egg","id":23,"spring":"1","summer":"0","fall":"1","winter":"0"},{"name":"Pale Morning Dun Dry","id":19,"spring":"1","summer":"1","fall":"0","winter":"0"},{"name":"Pale Morning Dun Nymph","id":17,"spring":"1","summer":"0","fall":"0","winter":"0"},{"name":"Stone Fly Dry","id":5,"spring":"1","summer":"0","fall":"0","winter":"0"},{"name":"Stone Fly Nymph","id":4,"spring":"1","summer":"1","fall":"0","winter":"0"},{"name":"Streamer","id":29,"spring":"0","summer":"0","fall":"1","winter":"0"},{"name":"Trico Dry","id":16,"spring":"0","summer":"1","fall":"0","winter":"0"},{"name":"Trico Nymph","id":14,"spring":"0","summer":"0","fall":"0","winter":"1"},{"name":"San Juan Worm","id":24,"spring":"1","summer":"1","fall":"1","winter":"1"},{"name":"Yellow Sally Dry","id":7,"spring":"0","summer":"1","fall":"0","winter":"0"},{"name":"Yellow Sally Nymph","id":6,"spring":"0","summer":"1","fall":"0","winter":"0"},{"name":"Hopper","id":27,"spring":"0","summer":"1","fall":"0","winter":"0"},{"name":"Blue Wing Olive Nymph","id":11,"spring":"1","summer":"1","fall":"0","winter":"1"},{"name":"Streamer","id":29,"spring":"1","summer":"0","fall":"1","winter":"1"}]},{"name":"Rotary Park","id":17,"desc":"The surface action can be outstanding on this stretch, which features slower water with a few super-deep holes. This is Steamboat's best opportunity to exploit the Green Drake hatch in late June, and on virtually any summer evening, you'll see clouds of caddis and blue-winged olives rising from the glassy water. Sundown happens later here, since this part of the valley is particularly broad and open. But these slower moving sections get warm during the doldrums of summer (late July and August). That is when you will need to fish the deepest channels using caddis and BWO nymphs or tan worms.\r\n\r\nThe wading here can be challenging, thanks to deep channels and pools. The river crossings aren't obvious, so few anglers fish from the opposite (west) bank. Thick willows along most of the banks reward solid roll-casting technique and make the Rotary park zone less than ideal for non-angling spectators. Scenery includes good views of Mt Werner's ski runs (to the east) and Emerald Mountain (to the west). A ridge separates the river from U.S. 40 and seals off traffic noise.\r\n\r\nWhere to go: From the parking lot, you have three options: 1) Fish at the boat put-in right at the lot, 2) Fish downstream, or 3) Walk upstream on the Yampa River Core Trail (a paved bike path). The upstream holes are the least crowded, but the slower water makes for harder fishing: Fish here get a long look at any fly you offer, so perfect presentation is required for hook ups. Get there by following the Core Trail upstream to Rotary Park boardwalk, which leads to a big meandering riverbed (about 5-10 minutes walk from the parking lot). To head downstream, walk around the closed access gates by the parking lot and follow the obvious footpath through hay fields for a couple minutes' walk to this stretches' three holes, defined by a few tight riverbeds. Beyond those, private land begins.","directions":"From downtown Steamboat, follow US 40 East for 2 miles and take the Mt. Werner Rd exit. At the stop sign, turn right, then make an immediate left into Rotary park.","bulletDescription":"Great dry fly action","bugs":[{"name":"Blue Wing Olive Dry","id":13,"spring":"0","summer":"1","fall":"1","winter":"0"},{"name":"Blue Wing Olive Emerger","id":12,"spring":"0","summer":"1","fall":"0","winter":"0"},{"name":"Blue Wing Olive Nymph","id":11,"spring":"1","summer":"1","fall":"0","winter":"0"},{"name":"Caddis Dry","id":22,"spring":"1","summer":"1","fall":"1","winter":"0"},{"name":"Caddis Nymph","id":20,"spring":"1","summer":"1","fall":"1","winter":"1"},{"name":"Hopper","id":27,"spring":"0","summer":"1","fall":"1","winter":"0"},{"name":"Egg","id":23,"spring":"1","summer":"0","fall":"1","winter":"0"},{"name":"Pale Morning Dun Dry","id":19,"spring":"1","summer":"1","fall":"0","winter":"0"},{"name":"Pale Morning Dun Nymph","id":17,"spring":"1","summer":"1","fall":"0","winter":"0"},{"name":"Stone Fly Dry","id":5,"spring":"1","summer":"0","fall":"0","winter":"0"},{"name":"Stone Fly Nymph","id":4,"spring":"1","summer":"1","fall":"0","winter":"0"},{"name":"Trico Dry","id":16,"spring":"0","summer":"1","fall":"0","winter":"0"},{"name":"Yellow Sally Dry","id":7,"spring":"1","summer":"0","fall":"0","winter":"0"},{"name":"Streamer","id":29,"spring":"0","summer":"0","fall":"1","winter":"0"}]}]}]